{"segments": [{"start": 0.09, "end": 24.79, "label": "chorus", "lyrics": "Darling, I keep— (Keep falling in love)\nDarling, I keep— (Keep falling in love)\nDa-da, da, keep (Keep falling in love)\nForever is too long (C'mon)"}, {"start": 24.79, "end": 48.94, "label": "verse", "lyrics": "Ooh, I got a problem, I don’t know if I can shake\nOoh, they wanna tie me down, that bondage just might break\nI can't sign the dotted line\nJust how long is forever? (It's too long, ah-hoo)"}, {"start": 48.94, "end": 68.51, "label": "chorus", "lyrics": "Darling, I keep— (Keep falling in love, keep falling in love)\nDarling, I keep— (Keep falling in love)\nDa-da, da, keep (Keep falling in love)\nForever is too long (Yuh, let that fire, check it, yo)"}, {"start": 68.51, "end": 127.21, "label": "verse", "lyrics": "I drive my Bimmer in the summer when I'm ready to drift\nLaFerrari handle better, and it's pretty as shit\nFeel safe in the Rolls, big boy when I drive\nLove 'em all for different reasons at the same damn time (Oh, yeah, yeah)\nSee, monogamy, that shit is not for me (Nah)\nOne option for everybody? Don't you lie to me (Don't you lie)\nToo many rules, I’m too curious to try to be\nHidin’ things, feelin' shame build inside of me\n’Cause honestly (Psh), T is not perfect\nSo how can I get everything from one person?\nI'm at the altar, but I'm still searchin'\nI’m only human, if it ain't work, things change\nAnd nothing stay the same, I believe\nHmm, maybe lettin' go is a beautiful thing\nPerfect for the time being, y'all ain't do nothin' wrong\nLife is short, but forever is so goddamn long\nI like alone time, I'm on my own time\nI love this girl, though, I hit the gold mine\nI'm thinkin' new crib, I'm thinkin' two kids\nUntil I get infatuated with a new bitch\nBut when that grey hair finally come (Uh-huh)\nAt least I felt somethin' if I ain't find the one (Yuh)\nNobody could fulfill me like this music shit does\nSo I'll be lonely with these Grammys when it's all said and done, c'mon (Oh)"}, {"start": 127.21, "end": 168.78, "label": "chorus", "lyrics": "Darling, I keep— (Keep falling in love, baby, I)\nDarling, I keep— (Keep falling in love, keep falling in love)\nDa-da, da, keep (Keep falling in love)\nForever is too long (Yeah, keep falling in love)\nYeah, baby\n\nKeep falling (Keep falling)\nKeep falling (Darling, I)\nKeep falling (Keep falling)\nKeep falling (I keep falling down)\nKeep falling, keep falling\nCome and catch me please (Oh, baby)"}, {"start": 168.78, "end": 205.74, "label": "verse", "lyrics": "Everybody's different, you know? And it's not just sex\nI get different things from different people, and I want you to explore too (Uh)\nHave those moments and experiences (Uh), I don't own you (Da-da-da-da-da)\nIt's not fair just to be stuck with me (Ah-hoo)"}, {"start": 205.74, "end": 244.59, "label": "chorus", "lyrics": "Darling (Darling, darling), keep falling in love (Ooh)\nDarling (Darling, I keep—), keep falling forever (Forever)\nDa-da-da-da, I'm falling, I'm falling (Oh-oh-oh)\nForever, da-da-da (Oh, baby)\n\nKeep falling (Keep falling)\nKeep falling (Darling, I)\nKeep falling (Keep falling)\nKeep falling (I keep falling down)\nKeep falling, keep falling\nCome and catch me please (Forever)\nKeep falling, keep falling (Forever is too long)\nKeep falling, keep falling (Forever is too long)\nKeep falling, keep falling"}, {"start": 244.59, "end": 253.96, "label": "outro", "lyrics": "Transparency is key, be honest"}], "bpm": 97}